In [4]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv(r'C:\Users\susmi\DSA\Students_Performance.csv')

In [6]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### 1. a. Find out how many males and females participated in the test.

In [8]:
gender_count = df['gender'].value_counts()

In [9]:
gender_count

female    518
male      482
Name: gender, dtype: int64

In [10]:
gender_count['male']

482

In [11]:
gender_count['female']

518

### 1. b. What do you think about the students' parental level of education?

In [12]:
parents_education = df['parental level of education'].value_counts()

In [13]:
parents_education

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

### 1. c. Who scores the most on average for math, reading and writing based on
###          i. Gender
###          ii. Test preparation course

### i. Gender

In [14]:
gender_score = df.groupby('gender').mean([['math score', 'reading score', 'writing score']])

In [15]:
gender_score

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [16]:
gender_score_more = gender_score.idxmax(axis=0)

In [17]:
gender_score_more

math score         male
reading score    female
writing score    female
dtype: object

### ii. Test preparation course

In [18]:
test_prep_score = df.groupby('test preparation course').mean([['math score', 'reading score', 'writing score']])

In [19]:
test_prep_score

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [20]:
testprep_score_more = test_prep_score.idxmax(axis=0)

In [21]:
testprep_score_more

math score       completed
reading score    completed
writing score    completed
dtype: object

### 1. d. What do you think about the scoring variation for math, reading and writing based on
### i. Gender
### ii. Test preparation course

### i. Gender

In [25]:
gender_variation = df.groupby('gender')[['math score', 'reading score', 'writing score']].std()

In [26]:
gender_variation

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

### ii. Test preparation course

In [27]:
preparation_variance = df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].std()

In [28]:
preparation_variance

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

### e. The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.

In [31]:
bonus_points = 10
df['bonus_points'] = df['math score'].apply(lambda x: bonus_points if x >= df['math score'].quantile(0.75) else 0)

In [33]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,bonus_points
0,female,group C,some high school,free/reduced,none,0,17,10,0
1,female,group B,high school,free/reduced,none,8,24,23,0
2,female,group B,some high school,free/reduced,none,18,32,28,0
3,female,group B,some college,standard,none,11,38,32,0
4,female,group C,some college,free/reduced,none,22,39,33,0
...,...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81,10
996,male,group A,some college,standard,completed,100,96,86,10
997,male,group D,some college,standard,completed,100,97,99,10
998,male,group E,associate's degree,free/reduced,completed,100,100,93,10
999,male,group E,bachelor's degree,standard,completed,100,100,100,10

In [34]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,bonus_points
0,female,group C,some high school,free/reduced,none,0,17,10,0
1,female,group B,high school,free/reduced,none,8,24,23,0
2,female,group B,some high school,free/reduced,none,18,32,28,0
3,female,group B,some college,standard,none,11,38,32,0
4,female,group C,some college,free/reduced,none,22,39,33,0

In [35]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,bonus_points
995,male,group E,some college,standard,completed,99,87,81,10
996,male,group A,some college,standard,completed,100,96,86,10
997,male,group D,some college,standard,completed,100,97,99,10
998,male,group E,associate's degree,free/reduced,completed,100,100,93,10
999,male,group E,bachelor's degree,standard,completed,100,100,100,10

### Case Study on Testing of Hypothesis

### 2. A company started to invest in digital marketing as a new way of their product promotions. For that they collected data and decided to carry out a study on it.

In [37]:
import numpy as np
import pandas as pd

In [38]:
dataframe = pd.read_csv(r'C:\Users\susmi\DSA\Sales_add.csv')

In [39]:
dataframe

,Month,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $)
0,Month-1,Region - A,Manager - A,132921,270390
1,Month-2,Region - A,Manager - C,149559,223334
2,Month-3,Region - B,Manager - A,146278,244243
3,Month-4,Region - B,Manager - B,152167,231808
4,Month-5,Region - C,Manager - B,159525,258402
5,Month-6,Region - A,Manager - B,137163,256948
6,Month-7,Region - C,Manager - C,130625,222106
7,Month-8,Region - A,Manager - A,131140,230637
8,Month-9,Region - B,Manager - C,171259,226261
9,Month-10,Region - C,Manager - B,141956,193735
10,Month-11,Region - B,Manager - C,159339,203175
11,Month-12,Region - A,Manager - A,178939,276279
12,Month-13,Region - B,Manager - A,145062,205180
13,Month-14,Region - A,Manager - A,151514,253131
14,Month-15,Region - C,Manager - A,147463,229336
15,Month-16,Region - A,Manager - B,177195,187305
16,Month-17,Region - A,Manager - C,140862,234908
17,Month-18,Region - C,Manager - B,167996,191517
18,Month-19,Region - B,Manager - A,132135,227040
19,Month-20,Region - A,Manager - B,152493,212579
20,Month-21,Region - B,Manager - A,147425,263388
21,Month-22,Region - A,Manager - C,130263,243020

### a. The company wishes to clarify whether there is any increase in sales after stepping into digital marketing.

In [42]:
sales_before_digital = dataframe['Sales_before_digital_add(in $)'].sum()

In [43]:
sales_before_digital

3283279

In [44]:
sales_after_digital = dataframe['Sales_After_digital_add(in $)'].sum()

In [45]:
sales_after_digital

5084722

In [48]:
print(f"Sales before Digital Marketing: ${sales_before_digital}")

Sales before Digital Marketing: $3283279

In [49]:
print(f"Sales after Digital Marketing: ${sales_after_digital}")

Sales after Digital Marketing: $5084722

In [50]:
if sales_after_digital > sales_before_digital:
    print("There is an increase in sales after stepping into digital marketing.")
else:
    print("There is a decrease in sales after stepping into digital marketing.")

There is an increase in sales after stepping into digital marketing.

### b. The company needs to check whether there is any dependency between the features “Region” and “Manager”.

In [51]:
from scipy.stats import chi2_contingency

In [54]:
contingency_table = pd.crosstab(dataframe['Region'], dataframe['Manager'])

In [55]:
contingency_table

Manager     Manager - A  Manager - B  Manager - C
Region
Region - A            4            3            3
Region - B            4            1            2
Region - C            1            3            1

In [60]:
chi2,p_value,_,_ = chi2_contingency(contingency_table)

In [61]:
p_value

0.5493991051158094

In [62]:
if p_value < 0.05:
    print("There is a dependency between Region and Manager.")
else:
    print("There is no significant dependency between Region and Manager.")

There is no significant dependency between Region and Manager.